#include "pll.h"
#include "sogi.h"
#include <stdint.h>

// Синус для 1/4 периода (от 0 до 256 включительно). Всего 257 элементов.
// Амплитуда: 0..32767
const int16_t sin_lut_1024[257] = {
			 0, 201, 402, 603, 804, 1005, 1206, 1407, 1608, 1809, 2009, 2210, 2410, 2611, 2811, 3012,
    3212, 3412, 3612, 3811, 4011, 4210, 4410, 4609, 4808, 5007, 5205, 5404, 5602, 5800, 5998, 6195,
    6393, 6590, 6786, 6983, 7179, 7375, 7571, 7767, 7962, 8157, 8351, 8545, 8739, 8933, 9126, 9319,
    9512, 9704, 9896, 10087, 10278, 10469, 10659, 10849, 11039, 11228, 11417, 11605, 11793, 11980, 12167, 12353,
    12539, 12725, 12910, 13094, 13279, 13462, 13645, 13828, 14010, 14191, 14372, 14553, 14732, 14912, 15090, 15269,
    15446, 15623, 15800, 15976, 16151, 16325, 16499, 16673, 16846, 17018, 17189, 17360, 17530, 17700, 17869, 18037,
    18204, 18371, 18537, 18703, 18868, 19032, 19195, 19357, 19519, 19680, 19841, 20000, 20159, 20317, 20475, 20631,
    20787, 20942, 21096, 21250, 21403, 21554, 21705, 21856, 22005, 22154, 22301, 22448, 22594, 22739, 22884, 23027,
    23170, 23311, 23452, 23592, 23731, 23870, 24007, 24143, 24279, 24413, 24547, 24680, 24811, 24942, 25072, 25201,
    25329, 25456, 25582, 25708, 25832, 25955, 26077, 26198, 26319, 26438, 26556, 26674, 26790, 26905, 27019, 27133,
    27245, 27356, 27466, 27575, 27683, 27790, 27896, 28001, 28105, 28208, 28310, 28411, 28510, 28609, 28706, 28803,
    28898, 28992, 29085, 29177, 29268, 29358, 29447, 29534, 29621, 29706, 29791, 29874, 29956, 30037, 30117, 30195,
    30273, 30349, 30424, 30498, 30571, 30643, 30714, 30783, 30852, 30919, 30985, 31050, 31113, 31176, 31237, 31297,
    31356, 31414, 31470, 31526, 31580, 31633, 31685, 31736, 31785, 31833, 31880, 31926, 31971, 32014, 32057, 32098,
    32137, 32176, 32213, 32250, 32285, 32318, 32351, 32382, 32412, 32441, 32469, 32495, 32521, 32545, 32567, 32589,
    32609, 32628, 32646, 32663, 32678, 32692, 32705, 32717, 32728, 32737, 32745, 32752, 32757, 32761, 32765, 32766,
    32767
};


// Быстрый синус. Принимает фазу 0..1023. Возвращает int16_t (-32767..32767)
int16_t get_sin_1024(uint32_t phase) {
    phase &= 0x3FF; // Зацикливаем фазу в диапазоне 0..1023
    
    uint32_t angle = phase & 0x1FF; // Сводим к полупериоду 0..511
    if (angle > 256) {
        angle = 512 - angle; // Зеркалим вторую четверть (257..511 -> 255..1)
    }
    
    int16_t val = sin_lut_1024[angle];
    
    if (phase > 511) {
        return -val; // Отрицательная полуволна для фаз 512..1023
    }
    return val;
}

// Быстрый косинус. Использует сдвиг фазы на 90 градусов (256 шагов)
int16_t get_cos_1024(uint32_t phase) {
    return get_sin_1024(phase + 256);
}

void ParkTransform_Q15(int16_t alpha, int16_t beta, int16_t sin_theta, int16_t cos_theta, int16_t *d, int16_t *q)
{		
	int32_t ud;
	int32_t uq;
	
//	uq = ( (int32_t)alpha * cos_theta + (int32_t)beta * sin_theta); // в этом варианте Ud стремиться к нулю при совпадении фаз
//	ud = (-(int32_t)alpha * sin_theta + (int32_t)beta * cos_theta); // uq максимальное отрицательное значение
	
	ud = (int32_t)alpha * sin_theta - (int32_t)beta * cos_theta; // в этом варианте Uq стремиться к нулю при совпадении фаз
	uq = (int32_t)alpha * cos_theta + (int32_t)beta * sin_theta; // ud максимальное положительное значение
	
	*d = (int16_t)(ud >> 15);
	*q = (int16_t)(uq >> 15);
	
	//uq = alpha * cos_theta - beta * sin_theta;
}

void PLL_Init(PLL_Q15_t *pll)
{
	pll->theta = 0;
	
	pll->omega_nom = 0;
	
	pll->omega = pll->omega_nom;
	
	pll->integrator = 0;
	
	pll->Ts = 0;
	
	/*
	 * init value
	 */
	
	pll->kp = 50500;
	pll->ki = 65000;
	
	pll->omega_min = -32768;
	pll->omega_max = 32767;
	
	pll->theta_2PI = 0;

	pll->phase_base 			= 60UL * 4294967296UL / 20000UL; //10737418UL;
	pll->phase_inc 				= pll->phase_base;
	pll->phase_inc_max 		= 70UL * 4294967296UL / 20000UL;
	pll->phase_inc_min 		= 30UL * 4294967296UL / 20000UL;
	pll->phase 		 = 0;
}

void PLL_Run(PLL_Q15_t *pll, int16_t alpha, int16_t beta)
{
	int16_t sin_theta;
	int16_t cos_theta;
	int16_t uq;
	int16_t ud;
	int32_t error;
	int32_t omega_hz_q15;
		
	sin_theta = get_sin_1024(pll->phase >> 22);
	cos_theta = get_cos_1024(pll->phase >> 22);	
	
	ParkTransform_Q15(alpha, beta, sin_theta, cos_theta, &ud, &uq);
		
	error = uq;																// q15
	
	omega_hz_q15 = (pll->kp * error) >> 15;		// q15 * q15 = q30 >>15
		
	/*
	 * PI
	 */
	pll->integrator += (pll->ki * error);			// q30 + (q15 * q15) 
	
	 if(pll->integrator >= 1073741823)
		  pll->integrator =  1073741823;
	 
	 if(pll->integrator < -1073741824) 
		  pll->integrator = -1073741824;	
	 
	 
	 omega_hz_q15 = omega_hz_q15 + (pll->integrator >> 15);
	// Примем что значение 32768 это частота 1 Гц.
	// Ограничиваем отклонение частоты в разумных пределах (например, +/- 30 Гц)
	// 30 Гц в Q15 = 30 * 32768 = 983040
	if(omega_hz_q15 > 983040)  omega_hz_q15 = 983040;
	if(omega_hz_q15 < -983040) omega_hz_q15 = -983040;
	
	// Сохраняем для отладки
	 pll->omega = uq;
	
	// 6. Масштабирование отклонения частоты (Гц в Q15) в шаг фазы (uint32_t)
	// Нам нужно умножить omega_hz_q15 на коэффициент (2^32 / (20000 * 32768)) = 6.5536
	// В фиксированной точке 6.5536 будет: (omega_hz_q15 * 26843) >> 12
	 
	// выход регулятора это поправка к частоте, показывает на сколько нужно увеличить или уменьшить частоту
	// выход регулятора q15 значит поправка к частоте на 1 гц равна 32768
	// а для изменения чатоты на 1 гц в формате фазы это 1 гц * 2^32 / 20000 = 214748 это поправка к фазе
	// поэтому появляется коэффициент соответствия 214748/32768 = 6,5536.
	// Но а нам необходимо например ограничить максимальное изменение частоты например на +/- 15 гц
	// поэтому коэффициент 6,5536 надо умножить 15 Гц 6,5536 * 15 = 98,34 равно примерно 100
	
	int32_t phase_inc_delta = (omega_hz_q15 * 100) ;

	pll->phase_inc = pll->phase_base + phase_inc_delta;
	 
	if(pll->phase_inc > pll->phase_inc_max)
		pll->phase_inc = pll->phase_inc_max;

	if(pll->phase_inc < pll->phase_inc_min)
		pll->phase_inc = pll->phase_inc_min;
	 
//		pll->omega += pll->integrator;
	 
//		if(pll->omega > pll->phase_inc_max)
//			pll->omega = pll->phase_inc_max;

//		if(pll->omega < pll->phase_inc_min)
//			pll->omega = pll->phase_inc_min;
	
	
//	/*
//	 * Ограничение частоты
//	 */
//	 
//	 if(pll->omega > pll->omega_max)
//		  pll->omega = pll->omega_max;
//	 
//	 if(pll->omega < pll->omega_min)
//		  pll->omega = pll->omega_min;
//	 
//	 /*
//		* Фаза
//	  */
//	 
//	 pll->theta += pll->omega * pll->Ts;
//	 
//	 if(pll->theta >= pll->theta_2PI)
//		  pll->theta -= pll->theta_2PI;
//	 
//	 if(pll->theta < 0.0f)
//		  pll->theta += pll->theta_2PI;
}
